In [56]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [57]:
df=pd.read_csv('titanic.csv')

In [58]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [59]:
df.drop(['PassengerId','Pclass','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [60]:
df

     Unnamed: 0  Survived     Sex   Age     Fare
0             0         0    male  22.0   7.2500
1             1         1  female  38.0  71.2833
2             2         1  female  26.0   7.9250
3             3         1  female  35.0  53.1000
4             4         0    male  35.0   8.0500
..          ...       ...     ...   ...      ...
886         886         0    male  27.0  13.0000
887         887         1  female  19.0  30.0000
888         888         0  female   NaN  23.4500
889         889         1    male  26.0  30.0000
890         890         0    male  32.0   7.7500

[891 rows x 5 columns]

In [61]:
df.drop(['Unnamed: 0'],axis='columns',inplace=True)

In [62]:
df.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [63]:
df.isna().sum()

Survived      0
Sex           0
Age         177
Fare          0
dtype: int64

In [64]:
df.fillna(df.mean(),inplace=True)

In [65]:
df.isna().sum()

Survived    0
Sex         0
Age         0
Fare        0
dtype: int64

In [66]:
inputs=df.drop('Survived',axis='columns')
target=df['Survived']

In [67]:
inputs

        Sex        Age     Fare
0      male  22.000000   7.2500
1    female  38.000000  71.2833
2    female  26.000000   7.9250
3    female  35.000000  53.1000
4      male  35.000000   8.0500
..      ...        ...      ...
886    male  27.000000  13.0000
887  female  19.000000  30.0000
888  female  29.699118  23.4500
889    male  26.000000  30.0000
890    male  32.000000   7.7500

[891 rows x 3 columns]

In [68]:
from sklearn.preprocessing import LabelEncoder

In [69]:
le_sex=LabelEncoder()

In [70]:
df['sex_n']=le_sex.fit_transform(df['Sex'])
df.head()

   Survived     Sex   Age     Fare  sex_n
0         0    male  22.0   7.2500      1
1         1  female  38.0  71.2833      0
2         1  female  26.0   7.9250      0
3         1  female  35.0  53.1000      0
4         0    male  35.0   8.0500      1

In [71]:
from sklearn import tree

In [72]:
model=tree.DecisionTreeClassifier()

In [73]:
df.drop(['Sex'],axis='columns',inplace=True)

In [74]:
df.head()

   Survived   Age     Fare  sex_n
0         0  22.0   7.2500      1
1         1  38.0  71.2833      0
2         1  26.0   7.9250      0
3         1  35.0  53.1000      0
4         0  35.0   8.0500      1

In [75]:
x=df.drop(['Survived'],axis='columns')
y=df['Survived']

In [77]:
model.fit(x,y)

DecisionTreeClassifier()

In [78]:
model.score(x,y)

0.9797979797979798

In [79]:
model.predict([[22,7.25,1]])

array([0], dtype=int64)

In [81]:
from sklearn.model_selection import train_test_split

In [82]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [83]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [ ]:
model.score(y)